[
    {
        "title": "Improbable launches new metaverse think tank amid strategic pivot",
        "description": "British unicorn Improbable has sharpened its metaverse focus with the launch of a new think tank. Dubbed the Metaverse Society, the think tank will explore the social and economic impacts of the nascent tech. Improbable told TNW that it wants to develop use c…",
        "content": "British unicorn Improbablehas sharpened its metaverse focus with the launch of a new think tank.\r\nDubbed the Metaverse Society, the think tank will explore the social and economic impacts of the nasc… [+2706 chars]"
    },
    {
        "title": "How the rise of generative AI could kill the metaverse — or save it",
        "description": "Will generative AI kill the metaverse? Maybe, maybe not. How their combination could build a dynamic digital future.",
        "content": "Join top executives in San Francisco on July 11-12, to hear how leaders are integrating and optimizing AI investments for success. Learn More\r\nFueled by the promise of a dynamic remote interactive en… [+1322 chars]"
    },
    {
        "title": "Facebook Gaming survey finds that casual gamers are crucial to the evolution of the metaverse",
        "description": "While the industry talks about the metaverse, turning it into a buzzword, the consumer world is on a very different level.",
        "content": "Gamers are bombarded with press about the metaverse, from think pieces to product announcements, but what do they really make of it all?  Facebook Gaming and Newzoo joined forces to launch a 2022 sur… [+6676 chars]"
    },
    {
        "title": "Build websites, games, and Metaverse experiences with this new service — no coding required",
        "description": "We thank our sponsor for making this content possible; it is not written by the editorial staff nor does it necessarily reflect its views.\n\n\n\nTL;DR: If you've ever wanted to bring a creation to life, you may have been hampered by the fact coding is a crucial …",
        "content": "We thank our sponsor for making this content possible; it is not written by the editorial staff nor does it necessarily reflect its views.\r\nTL;DR: If you've ever wanted to bring a creation to life, y… [+1988 chars]"
    },
    {
        "title": "Facebook Parent In Talks With Magic Leap Over Augmented Reality Deal",
        "description": "Facebook's parent company Meta is reportedly in discussions with augmented reality start-up Magic Leap to establish a multiyear agreement for intellectual property licensing and contract manufacturing in North America. While the partnership is not expected to…",
        "content": "Magic Leap produces custom components, including high-tech lenses and associated software, which are key technologies that may be required to build a metaverse. Two former employees said Magic Leap's… [+454 chars]"
    },
    {
        "title": "London crowned tech king of the world",
        "description": "London has been named the world’s most high-tech city, according to Z/Yen Group’s seventh edition of the Smart Centres Index, published today.   The British capital secured the top spot for its world-leading financial services, deep talent pool, quality of it…",
        "content": "London has been named the worlds most high-tech city, according to Z/Yen Groups seventh edition of the Smart Centres Index, published today.  \r\nThe British capital secured the top spot for its world-… [+1276 chars]"
    },
    {
        "title": "Meta just laid off a bunch of employees right before its big VR showcase",
        "description": "The final wave of planned Meta layoffs has displaced an estimated 5,000 employees from the company just a week before Meta's big VR gaming showcase is to take place.",
        "content": "<ul><li>The third round of planned major layoffs at Meta occurred on May 24, 2023, displacing an estimated 5,000 employees.</li><li>The Comms team and several project and policy managers from Reality… [+1790 chars]"
    },
    {
        "title": "3 Ways You Can Experience the Metaverse Without a VR Headset",
        "description": "You don't need that expensive VR headset to get stuck into the metaverse.",
        "content": "When you think of the metaverse, what automatically comes to mind is a 3D simulation, a world you can only access with a virtual reality (VR) headset. However, you can also access the metaverse witho… [+7189 chars]"
    },
    {
        "title": "Microsoft Teams avatars are here for everyone... if you're a business user",
        "description": "Microsoft Teams has a pair of features for the metaverse. Avatar support is now available for all business and enterprise users and immersive spaces are on the way.",
        "content": "<ul><li>Microsoft Teams has several new ways to immerse yourself in meetings and conversations.</li><li>Avatars for Microsoft Teams are now generally available, allowing users to join meetings with 3… [+1752 chars]"
    },
    {
        "title": "Budding fashion designers are learning the benefits of creating digital outfits for Roblox",
        "description": "The Parsons School of Design teamed up with Roblox, an online gaming platform, for a course on designing outfits for the digital realm.",
        "content": "This digital design space, although still an emerging market, could offer potential jobs and financial streams for designers in the future.Roblox\r\n<ul>\n<li>This year the Parsons School of Design team… [+2099 chars]"
    },
    {
        "title": "No one cares about the metaverse. So what does that mean for Apple’s VR plans?",
        "description": "Mark Zuckerberg’s vision for the metaverse is falling flat but that doesn’t mean Apple’s VR plans are doomed – here’s why.",
        "content": "The metaverse is a ghost town. After several years of hype, virtual spaces that were meant to be filled with users, concerts, offices, shops, games and even brands keen to part you from your virtual … [+6855 chars]"
    },
    {
        "title": "Microsoft Build 2023: the biggest announcements in AI, Windows, and more",
        "description": "Microsoft's annual developer conference has brought lots of interesting announcements in the world of AI, Windows, Edge, and more.",
        "content": "Microsoft’s annual developer’s conference has arrived, and a slew of big announcements have already been unveiled. AI is, obviously, the big theme of the event and continues to be top-of-radar for Mi… [+3737 chars]"
    },
    {
        "title": "‘They’re afraid their AIs will come for them’: Doug Rushkoff on why tech billionaires are in escape mode",
        "description": "The leading intellect on digital culture believes the recent tech reckoning is corrective justice for Silicon Valley baronsIt was a tough week in tech.The top US health official warned about the risks of social media to young people; tech billionaire Elon Mus…",
        "content": "It was a tough week in tech.\r\nThe top US health official warned about the risks of social media to young people; tech billionaire Elon Musk further trashed his reputation with the disastrous Twitter … [+5524 chars]"
    },
    {
        "title": "3 Best Metaverse Stocks to Buy in 2023 and Beyond",
        "description": "According to some estimates, the metaverse industry could be worth $13 trillion by 2030.",
        "content": "The metaverse is a digital realm that transcends our understanding of reality. In this three-dimensional universe, people immerse themselves in a virtual environment and connect with others in the di… [+4286 chars]"
    },
    {
        "title": "Apple's Mixed Reality Headset: What to Expect From WWDC's Big Reveal - CNET",
        "description": "Long-awaited and still mysterious, Apple's VR headset could be the spark for a whole new wave of hardware and software.",
        "content": "Apple's next big product looks like it'll cost $3,000, rest on your face and need to be tethered to a battery pack. Whatever this expected VR headset ends up being, it isn't immediately clear what it… [+10363 chars]"
    },
    {
        "title": "You can now try out avatars and virtual spaces in Microsoft Teams",
        "description": "Microsoft is showcasing several new feature updates for its Teams app during its Build Developers conference this week.",
        "content": "Microsoft has announced the rollout of several anticipated features for Teams, including avatar support and immersive spaces.\r\nThe company is showcasing the new features during its annual Build devel… [+2257 chars]"
    },
    {
        "title": "How Taylor Swift’s Eras tour took over America",
        "description": "The superstar’s 52-stop US tour has dominated headlines since March with fan theories, romantic controversy and even a congressional hearingOn St Patrick’s Day of this year, Taylor Swift kicked off her Eras Tour, a 52-stop showcase encompassing all ten of her…",
        "content": "On St Patricks Day of this year, Taylor Swift kicked off her Eras Tour, a 52-stop showcase encompassing all ten of her studio albums. Since then, people have fallen into three categories: either you … [+6447 chars]"
    },
    {
        "title": "Digital Twins, Generative AI, And The Metaverse",
        "description": "Exploring the convergence of digital twins, generative AI, and the metaverse, this article delves into the future, where these tech trends democratize 3D design.",
        "content": "If there are three buzzword topics that have certainly been responsible for a fair amount of hype over the past few years, they would be digital twins, generative AI, and the metaverse.\r\nDigital Twin… [+7779 chars]"
    },
    {
        "title": "3 Metaverse Stocks to Sell as They Fail to Deliver",
        "description": "InvestorPlace - Stock Market News, Stock Advice & Trading Tips The metaverse hasn't lived up to the hype, so don't get caught out when these metaverse stocks drop hard and fast as they fail to deliver. The post 3 Metaverse Stocks to Sell as They Fail to Deliv…",
        "content": "InvestorPlace - Stock Market News, Stock Advice &amp; Trading TipsThe metaverse hasn't lived up to the hype, so don't get caught out when these metaverse stocks drop hard and fast as they fail to del… [+280 chars]"
    },
    {
        "title": "The AI Revolution: How Meta Platforms Is Positioning Itself for Success",
        "description": "Meta Platforms is the AI stock to watch for the next few years.",
        "content": "MetaPlatforms (META 0.06%), formerly known as Facebook, has been at the forefront of numerous technological advancements, including social media networking and others.\r\nNow, it is leveraging artifici… [+3509 chars]"
    },
    {
        "title": "The Next Digital Revolution: 2 Ways To Get Ready For The Future Internet",
        "description": "Companies can act now to reap the benefits of the metaverse and web3 technologies so they are well-positioned for future growth and success.",
        "content": "The metaverse and web3 technologies offer new and exciting ways for companies across a wide variety of sectors to improve their products, services, and operations. From VR and AR to transforming trad… [+6183 chars]"
    },
    {
        "title": "Facebook Loses Its Mojo Again, Two Lessons In Failed Foresight And A Solution",
        "description": "The company’s name has changed to Meta and that means the commitment to the idea of the metaverse is absolute, locked in stone.",
        "content": "How can a major corporation invest $16B for a return equal to the cost of a new, 2023 Ford Bronco for every one of their regular users, or a seat on a private airplane to and across the United States… [+3894 chars]"
    },
    {
        "title": "Thanks to VR, the Metaverse Is Still Destined for Greatness",
        "description": "InvestorPlace - Stock Market News, Stock Advice & Trading Tips Within the next 12 months, we expect a few VR innovations to come to market. And then the metaverse will finally start to come into its own. The post Thanks to VR, the Metaverse Is Still Destined …",
        "content": "InvestorPlace - Stock Market News, Stock Advice &amp; Trading TipsWithin the next 12 months, we expect a few VR innovations to come to market. And then the metaverse will finally start to come into i… [+190 chars]"
    },
    {
        "title": "Top metaverse property investments suffer massive losses: Report",
        "description": "Prices of virtual lands on some of the top Metaverses have reduced significantly when compared to their peak prices of 2022, with most depreciating around 90% in value. A study published by CoinGecko shows that popular metaverse properties, such as Otherdeeds…",
        "content": "Prices of virtual lands on some of the top Metaverses have reduced significantly when compared to their peak prices of 2022, with most depreciating around 90% in value.A study published by CoinGecko … [+301 chars]"
    },
    {
        "title": "6 Open Source Web3 Projects Worth Checking Out in 2023",
        "description": "2022 saw both an insane rise and then fall in the interest of Web3 and blockchain development. In the first half of the year, it felt like every time I logged onto Twitter, I’d see an update from a new brand that secured funding or an update on a project’s in…",
        "content": "2022 saw both an insane rise and then fall in the interest of Web3 and blockchain development.\r\nIn the first half of the year, it felt like every time I logged onto Twitter, I’d see an update from a … [+8618 chars]"
    },
    {
        "title": "Down 71%, This Growth Stock Could Help You Build a Fortune",
        "description": "This innovative company could be in the early stages of a massive long-term growth trajectory.",
        "content": "While the Nasdaq Composite index is up roughly 21.5% this year, it also remains down roughly 21% from its all-time high. Growth stocks are still in bear market territory, and many companies that saw … [+4732 chars]"
    },
    {
        "title": "‘Those who hate AI are insecure’: inside Hollywood’s battle over artificial intelligence",
        "description": "‘We are at a cocktail party pretending we know what we’re talking about,’ an editor said. But it’s clear the role of AI in cinema is dividing the industryOn the picket lines outside Los Angeles film studios, artificial intelligence has become a central antago…",
        "content": "On the picket lines outside Los Angeles film studios, artificial intelligence has become a central antagonist of the Hollywood writers strike, with signs warning studio executives that writers will n… [+11033 chars]"
    },
    {
        "title": "Meta's ‘Efficiency’ Layoffs Take a Toll on Employees' Productivity",
        "description": "(Bloomberg) -- Meta Platforms Inc. employees received news Wednesday of the final round of previously announced job cuts, which affected thousands of workers...",
        "content": "(Bloomberg) -- Meta Platforms Inc. employees received news Wednesday of the final round of previously announced job cuts, which affected thousands of workers in the companys business departments. Now… [+3447 chars]"
    },
    {
        "title": "Is It Too Late to Buy Meta Platforms Stock?",
        "description": "Meta stock has more than doubled this year. Can it keep the hot streak alive?",
        "content": "With gains of 110% so far, Meta Platforms(META 3.70%) has been one of the tech sector's best-performing stocks this year. In addition to investors generally warming back up to companies with growth-d… [+4459 chars]"
    },
    {
        "title": "Is it worth it? Must-have apps vs. the money drains",
        "description": "Many of the apps on our smartphones can trick us with free trial periods but then charge huge subscription fees. Here's what's worth the money and what isn't.",
        "content": "Seeing a charge come through for a streaming service you forgot you even subscribed to is a special kind of frustration.\r\nThis is bound to happen if you sign up for free trials but never set a remind… [+5853 chars]"
    },
    {
        "title": "It seems there are only two modes of billionaire: deathly dull or unstoppably cringe | Joel Golby",
        "description": "What would you buy if you were richer than God? Surely something cooler than an eerie statue of your girlfriend for the prow of your yachtI’m always disappointed by the outer reaches of my own imagination when I sit and idly wonder about myself as a rich pers…",
        "content": "Im always disappointed by the outer reaches of my own imagination when I sit and idly wonder about myself as a rich person. For some reason having a full-sized pool table is always involved. Three ho… [+4537 chars]"
    },
    {
        "title": "EY survey: Tech leaders to invest in AI, 5G, cybersecurity, big data, metaverse - TechRepublic",
        "description": "EY survey: Tech leaders to invest in AI, 5G, cybersecurity, big data, metaverse  TechRepublic",
        "content": "We use cookies and data to<ul><li>Deliver and maintain Google services</li><li>Track outages and protect against spam, fraud, and abuse</li><li>Measure audience engagement and site statistics to unde… [+1131 chars]"
    },
    {
        "title": "Metaverse in Education: Are VR classrooms the future of education ... - YouTube",
        "description": "Metaverse in Education: Are VR classrooms the future of education ...  YouTube",
        "content": "We use cookies and data to<ul><li>Deliver and maintain Google services</li><li>Track outages and protect against spam, fraud, and abuse</li><li>Measure audience engagement and site statistics to unde… [+1131 chars]"
    },
    {
        "title": "Crypto week at glance: Markets turn volatile amid ongoing debt ceiling discussions and rising inflation",
        "description": "Bitcoin has seen a decline of 9% in its month-to-date performance. Currently, BTC faces a resistance level at US$26,471. If the price manages to close near this level, it could potentially pave the way for further upward movement towards the US$26,600 and US$…",
        "content": "The global cryptocurrency market has experienced a turbulent week, as investors grapple with various factors such as the ongoing debt ceiling stalemate and rising inflation in the UK. Bitcoin, in par… [+3913 chars]"
    },
    {
        "title": "Do Consumers Really Want A Mixed-Reality Headset?",
        "description": "However, one of the questions we need to ask, even before Apple and others potentially enter and expand the market for VR-XR and AR headsets, is, does anyone want them?",
        "content": "Apple's upcoming WWDC 2023 may see the launch of its speculated mixed reality device.\r\nApple\r\nIn two weeks, Apple will reportedly unveil its first MR/AR headset at its World Wide Developer Conference… [+5088 chars]"
    },
    {
        "title": "3 Things About Meta Platforms That Smart Investors Know",
        "description": "The social networking giant still has a lot of irons in the fire.",
        "content": "Most investors likely recognize Meta Platforms(META 3.70%) as the social media titan that reaches more than 3.8 billion people monthly through Facebook, Messenger, Instagram, and WhatsApp. They also … [+4952 chars]"
    },
    {
        "title": "Twitter's Takedown Coming Soon: Welcome, 'Instagram For Your Thoughts'",
        "description": "As if Meta doesn’t have its hands in enough honey pots, it looks like the tech giant has its gaze set on something new. While continuing to invest billions in its metaverse vision, VR hardware, emerging AI technologies, and a string of massively popular socia…",
        "content": "As if Meta doesnt have its hands in enough honey pots, it looks like the tech giant has its gaze set on something new. While continuing to invest billions in its metaverse vision, VR hardware, emergi… [+320 chars]"
    },
    {
        "title": "Crypto CEO falls victim to latest Twitter hack",
        "description": "As of 8:26 pm UTC, the alleged scam site had been taken down and displayed a 404 error. The crypto CEO cautioned users to avoid clicking on any suspicious links related to an airdrop or URLs that appear scam-like. Arthur Madrid, co-founder and CEO of The Sand…",
        "content": "As of 8:26 pm UTC, the alleged scam site had been taken down and displayed a 404 error.The crypto CEO cautioned users to avoid clicking on any suspicious links related to an airdrop or URLs that appe… [+302 chars]"
    },
    {
        "title": "16 Real Estate Social Media Statistics to Know in 2023",
        "description": "If you’ve ever seen a real estate agent’s smiling face on a bench, billboard, or bus (loving the blazers, ya’ll!),…\nThe post 16 Real Estate Social Media Statistics to Know in 2023 appeared first on Social Media Marketing & Management Dashboard.",
        "content": "If youve ever seen a real estate agents smiling face on a bench, billboard, or bus (loving the blazers, yall!), you know that advertising is a key part of the business. But in 2023, the most powerful… [+9341 chars]"
    },
    {
        "title": "Meta laid off 6,000 employees to save \"billion dollars\"",
        "description": "Meta has initiated its third round of layoffs to reduce costs and streamline operations. Investors have responded positively to Meta's major cost-cutting efforts. Here are the details. Read more...",
        "content": "Meta has started its third round of layoffs as part of a comprehensive plan to reduce costs and streamline operations. The latest round of job cuts targets employees within Meta's business groups, fo… [+2032 chars]"
    },
    {
        "title": "The Sandbox CEO’s Twitter Hacked to Promote Crypto Scam",
        "description": "Arthur Madrid, the CEO of The Sandbox, a metaverse project, fell victim to a Twitter account hack on May 26.",
        "content": "The Sandbox CEOs Twitter Hacked to Promote Crypto Scam\r\nArthur Madrid, the CEO of The Sandbox, a metaverse project, fell victim to a Twitter account hack on May 26. Madrid announced the incident in a… [+974 chars]"
    },
    {
        "title": "Dentsu’s new web3 readiness tool shines light on the tech’s potential to complement AI",
        "description": "Dentsu's Innovation Initiative is launching a web3 readiness index next month — at a time when the industry is obsessed with AI. Could the two technologies actually make a good pair?",
        "content": "Dentsus Innovation Initiative is launching a web3 readiness index next month aimed at guiding clients on how to prepare their brands to use the technology as well as to drive adoption at a time when … [+4289 chars]"
    },
    {
        "title": "Vertex Labs Acquires Digimental Studio For Us$12 Million",
        "description": "LONDON, UNITED KINGDOM, May 23rd, 2023, Chainwire Vertex Labs (Vertexlabs.uk), the brain behind the Caduceus metaverse protocol, Vertex Network and 3D metaverse platform, LightCycle, has acquired London-based digital art studio, Digimental Studio (Digimental)…",
        "content": "LONDON, UNITED KINGDOM, May 23rd, 2023, Chainwire\r\nVertex Labs(Vertexlabs.uk),the brain behind the Caduceus metaverse protocol, Vertex Network and 3D metaverse platform, LightCycle, has acquired Lond… [+6160 chars]"
    },
    {
        "title": "In battle to be Asia’s crypto hub, which city will emerge victorious?",
        "description": "Top blockchain and crypto news: Asia’s crypto hub race. Is US debt ceiling fight a boon or a bane for crypto? China's red carpet for metaverse investment.",
        "content": "In this issue\r\n<ol><li>Asias Web3 crown: Ready, set, fight\r\n</li><li>US debt ceiling: Win or loss for crypto?\r\n</li><li>Metaverse in China: Red carpet\r\n</li></ol>From the editors desk\r\nDear Reader,\r\n… [+18354 chars]"
    },
    {
        "title": "Could a Twitter Clone Solve Meta Platforms' Biggest Problem?",
        "description": "Would a new social media app help solve Meta's ongoing issue with slowing growth?",
        "content": "Meta Platforms (META 1.40%) has struggled to generate strong, consistent growth over the past year. In 2023's first quarter, revenue rose by a modest 3% year over year to $28.6 billion. While the com… [+3754 chars]"
    },
    {
        "title": "Artists At Berlin Gallery Weekend Question What It Means To Be Human",
        "description": "Leading the conversation at Berlin Gallery Weekend, artist Cao Fei offers many possibilities for future environments and the human experience including a new avatar.",
        "content": "In Duotopia Cao Fei is giving nebulous concepts visual identity \r\nLeigh Banks\r\nArtists have long turned to science fiction, to worlds of the imagination, to understand what it is to be human. This ge… [+5015 chars]"
    },
    {
        "title": "Could These 3 Stocks Be Worth $1 Trillion by 2030?",
        "description": "Some of these companies would have to blow expectations out of the water to achieve a $1 trillion market cap.",
        "content": "With only five companies worldwide currently valued above $1 trillion, it's an exclusive club few can ever hope to reach. However, three stocks are knocking on the door and could reach $1 trillion by… [+5003 chars]"
    },
    {
        "title": "It Sounds Like PlayStation VR2 Is Off To A Strong Start",
        "description": "Sony has revealed better than anticipated sales figures for the PS VR2, its VR peripheral for the PlayStation 5, It could be good news for VR as a whole, too.",
        "content": "It seems reports of VR's death have been greatly exaggerated. Despite Mark Zuckerberg's shifting focus to AI after pouring billions into the Metaverse and products like Microsoft's HoloLens failing t… [+1244 chars]"
    },
    {
        "title": "Chinese city launches govt-backed metaverse platform",
        "description": "Nanjing launches China's Blockchain Technology and Application Innovation Platform to advance metaverse research as Shanghai makes strides in the metaverse industry and Wu Zhong-ze emphasizes sector expansion and industry standards.",
        "content": "Nanjing City, the capital of Jiangsu Province in China, on May 22, inaugurated the China Blockchain Technology and Application Innovation Platform. This government-supported platform aims to foster a… [+2331 chars]"
    },
    {
        "title": "Microsoft advances mixed-reality plans with Teams avatars, Mesh update",
        "description": "Amid the numerous AI-related announcements at its Build developer conference this week, Microsoft also delivered updates on key aspects of its vision of a workplace “metaverse,” with the release of avatars for Teams and private previews of its Mesh mixed-real…",
        "content": "Amid the numerous AI-related announcements at its Build developer conference this week, Microsoft also delivered updates on key aspects of its vision of a workplace metaverse, with the release of ava… [+5160 chars]"
    },
    {
        "title": "It is right that big tech leans up and focuses on profitable activities",
        "description": "In this editorial, I argue that big tech companies are making the right decision by making sweeping job cuts, despite being hard to do and hard on the people whose lives are affected as a result. Read more...",
        "content": "With more than a decade of cheap money coming to an end thanks to higher interest rates, weve seen many big tech companies lay off employees, with some continuing to make more cuts. Its awful to be o… [+5357 chars]"
    },
    {
        "title": "Is the 'metaverse' the real deal? One industry exec is staking his company on it",
        "description": "Corporate VR technology is laying the foundation for a mainstream consumer product, according to Daniel O’Brien, the Americas president of VR headset...",
        "content": "Meta's (META) struggles with the world of virtual reality aside, Daniel O'Brien, America's president of VR headset developer HTC Vive, contends the technology is spreading in the corporate world and … [+3167 chars]"
    },
    {
        "title": "Nvidia Stock Soars 29% As CEO Jensen Huang Cites Generative AI Edge",
        "description": "Nvidia CEO Jensen Huang said the company was seeing \"surging demand\" for its data center products.",
        "content": "Signage with logo at the Silicon Valley headquarters of computer graphics hardware company Nvidia, ... [+] Santa Clara, California, August 17, 2017. (Photo via Smith Collection/Gado/Getty Images).\r\nG… [+7099 chars]"
    },
    {
        "title": "This Week In XR/AI: Anthropic Adds $450 Million, NReal Rebrands As XReal, Intros New Beam XR Glasses",
        "description": "The countdown beings for Apple's Reality Pro introduction June 5th.",
        "content": "CUPERTINO, CALIFORNIA - JUNE 06: Apple CEO Tim Cook delivers a keynote address during the WWDC22 at ... [+] Apple Park on June 06, 2022 in Cupertino, California. Apple CEO Tim Cook kicked off the ann… [+6726 chars]"
    },
    {
        "title": "The Hong Kong Police Force launch new metaverse platform, ‘CyberDefender’",
        "description": "According to a May 27 statement, the Cyber Security and Technology Crime Bureau (CSTCB) of the Hong Kong Police have launched a metaverse platform, ‘CyberDefender,’ in an effort to educate the younger generation on technology crimes.",
        "content": "The cyber security unit of the Hong Kong Police Force have launched CyberDefender, a new metaverse platform designed to educate the public of the potential dangers associated with Web3 and the metave… [+2628 chars]"
    },
    {
        "title": "Why a Meta-Magic Leap partnership makes sense – and may or (may not) be all about Apple",
        "description": "Meta (META) is reportedly in talks with augmented reality (AR) headset maker Magic Leap to license its tech. It's a deal that would make a lot of sense, as...",
        "content": "Meta (META) is reportedly in talks with augmented reality (AR) headset maker Magic Leap to license its tech. It's a deal that would make a lot of sense, as the possible drop of Apple's (AAPL) mixed r… [+4544 chars]"
    },
    {
        "title": "3 Stocks I'm Excited to Buy in May",
        "description": "Between you and me, I can't wait to buy these three stocks.",
        "content": "I'm no fan of the saying, \"Sell in May and go away.\" Unsurprisingly, and in keeping with The Motley Fool's guidance, I tend to hold stocks for the long term. In fact, rather than selling in May, I'm … [+3022 chars]"
    },
    {
        "title": "China's Metaverse Ambition, Web3 Investment Challenge Country's Stiff Crypto Position",
        "description": "Beijing released a whitepaper on the development of the metaverse, noting that web3 technology is an \"inevitable trend for future internet industry development.\"",
        "content": "KEY POINTS\r\n<ul><li>State broadcaster CCTV broadcasted Hong Kong's decision to accept license applications for crypto exchanges last week</li><li>The city of Nanjing has debuted the China Metaverse T… [+3284 chars]"
    },
    {
        "title": "Top Metaverse property investments suffer massive losses: Report",
        "description": "Popular metaverse properties, such as Otherdeeds, The Sandbox, Decentraland, Somnium and Voxels, have all depreciated in value over the past year from January 1, 2022, to May 24, 2023.",
        "content": "Prices of virtual lands on some of the top Metaverses have reduced significantly when compared to their peak prices of 2022, with most depreciating around 90% in value. \r\nA study published by CoinGec… [+2023 chars]"
    },
    {
        "title": "It’s 2023: Here Are The Top Tech Trends To Watch",
        "description": "While 2023 has kicked off at full speed, there is so much we can anticipate in the coming months.",
        "content": "Sam Yoshida is EVP &amp; GM, BICG &amp; HSG, Canon USA; Chair &amp; CEO, Canon Financial Services; Chair &amp; CEO, Canon Solutions America.\r\ngetty\r\nTechnology is an inevitable part of our daily live… [+5429 chars]"
    },
    {
        "title": "Facebook owner Meta begins final round of mass layoffs",
        "description": "Job cuts are part of plan announced in March to eliminate 10,000 roles, bringing headcount to where it stood mid-2021Meta started carrying out the last batch of a three-part round of layoffs on Wednesday, according to a source familiar with the matter, as par…",
        "content": "Meta started carrying out the last batch of a three-part round of layoffs on Wednesday, according to a source familiar with the matter, as part of a plan announced in March to eliminate 10,000 roles.… [+2171 chars]"
    },
    {
        "title": "Shiba Inu Gears Up For Massive 'Shib: The Metaverse' Update As Initial Launch Draws Near",
        "description": "\"Shib: The Metaverse\" will see a multi-platform launch including mobile devices, PC and virtual reality (VR) devices, allowing the platform to be accessible to everyone even if they only have mobile phones.",
        "content": "KEY POINTS\r\n<ul><li>\"Shib: The Metaverse\" WAGMI preview was dropped in March</li><li>The team is set to launch four hubs by September</li><li>Rocket Pond, along with Ryoshi and Tech Trench HUBS, will… [+3479 chars]"
    },
    {
        "title": "Facebook owner Meta slashes business teams in final round of layoffs",
        "description": "Dozens of employees working in teams such as marketing, site security, enterprise engineering, program management, content strategy and corporate communications took to LinkedIn to announce that they were laid off.",
        "content": "Meta Platforms Inc , owner of Facebook, slashed jobs across its business and operations units on Wednesday as it carried out its last batch of a three-part round of layoffs, part of a plan announced … [+2708 chars]"
    },
    {
        "title": "10 new social media features you need to know this week",
        "description": "Updates from Meta, Twitter, Instagram and more.   It’s already been a busy week, comms pros and it’s only Tuesday! There’s so much to keep up with after beaucoup updates on social media platforms including a looming deadline in Montana.  In lighter news, What…",
        "content": "Its already been a busy week, comms pros and its only Tuesday! Theres so much to keep up with after beaucoup updates on social media platforms including a looming deadline in Montana. \r\nIn lighter ne… [+3599 chars]"
    },
    {
        "title": "World’s Most Valuable Chipmaker Nvidia Unveils More AI Products After $184 Billion Rally",
        "description": "(Bloomberg) -- In a two-hour presentation in Taiwan, Nvidia Corp. Chief Executive Officer Jensen Huang unveiled a new batch of products and services tied to ...",
        "content": "(Bloomberg) -- In a two-hour presentation in Taiwan, Nvidia Corp. Chief Executive Officer Jensen Huang unveiled a new batch of products and services tied to artificial intelligence, looking to capita… [+4649 chars]"
    },
    {
        "title": "Shiba Inu’s Puppynet Testnet Logs 10M Transactions, Putting Ecosystem Tokens in Focus",
        "description": "Ecosystem tokens shiba inu, leash and bone will be used to transact on the upcoming Ethereum-based blockchain.",
        "content": "Shibarium networks native test network, Puppynet, crossed 10 million transactions earlier this week in a sign of rising activity ahead of a release on the mainnet planned for later this year.\r\nBlockc… [+1721 chars]"
    },
    {
        "title": "Nvidia Sales Crush Wall Street Estimates Thanks To AI Boom, Shares Spike Over 20%",
        "description": "Chipmaker reported Q1 earnings for its fiscal 2024 that drove shares up more than 25% in after-hours trading.",
        "content": "SOPA Images/LightRocket via Getty Images\r\nNvidia reported first-quarter earnings that beat Wall Street estimates, driving its stock up more than 25% in extended trading. The company said it is boosti… [+2737 chars]"
    },
    {
        "title": "Microsoft brings avatars to Teams enterprise customers to spruce up meetings",
        "description": "You'll be pleased to know that, if you're a Teams users, avatars are now generally available for all Microsoft 365 Business and Enterprise licenses starting ...",
        "content": "The tedium of videoconferencing getting you down? Fret not. You'll be pleased to know that, if you're a Teams users, avatars are now generally available for all Microsoft 365 Business and Enterprise … [+2469 chars]"
    },
    {
        "title": "BBC Studios take Doctor Who to the Metaverse",
        "description": "BBC Studios has teamed up with Reality+ to launch a collection of immersive experiences in the metaverse based on the BBC’s world-famous brands (from Doctor Who News)",
        "content": "BBC Studios has teamed up with Reality+ to launch a collection of immersive experiences in the metaverse based on the BBC’s world-famous brands including Doctor Who.\r\n\n\nBBC Studios has partnered with… [+2721 chars]"
    },
    {
        "title": "Blender 3D World Building Workshop, May 24",
        "description": "SavyfromNOWHEREio writes: Join our free Blender course in the NOWHERE.io metaverse with engineer Sonny Cirasuolo for a bi-weekly, all-levels FREE course in Blender basics for building your very own 3D world. Come with your work, your questions, or nothing at …",
        "content": "Join our free Blender course in the NOWHERE.io metaverse with engineer Sonny Cirasuolo for a bi-weekly, all-levels FREE course in Blender basics for building your very own 3D world. Come with your wo… [+412 chars]"
    },
    {
        "title": "Who Owns AI-Generated Content? Understanding Ownership, Copyrighting, and How the Law interprets AI-generated Art",
        "description": "Who Owns AI-Generated Content? Understanding Ownership, Copyrighting, and How the Law interprets AI-generated ArtDisclaimer – This article was written considering current United States intellectual property laws as of May 2023. If you’re interested in knowing…",
        "content": "Disclaimer – This article was written considering current United States intellectual property laws as of May 2023. If youre interested in knowing more about your countrys IP laws and view on AI, I re… [+13700 chars]"
    },
    {
        "title": "Build 2023: Avatars for Microsoft Teams Meetings Are Coming This Week",
        "description": "Microsoft Teams avatars are going out of preview on the Teams desktop app for Windows and macOS this week.\nThe post Build 2023: Avatars for Microsoft Teams Meetings Are Coming This Week appeared first on Thurrott.com.",
        "content": "Microsoft Teams avatars are going out of preview on the Teams desktop app for Windows and macOS this week. After Zoom introduced animal avatars and then human-looking avatars, the new Microsoft Teams… [+1286 chars]"
    },
    {
        "title": "Nvidia Stock Soars 25% as AI-Powered Guidance Demolishes Estimates",
        "description": "In Q1, the tech giant's data center platform generated record revenue, driven by \"surging demand\" for its products that enable generative artificial intelligence capabilities.",
        "content": "Shares of Nvidia(NVDA -0.49%) skyrocketed 24.7% in after-hours trading on Wednesday following the graphics chip specialist's release of its first-quarter report for fiscal 2024.\r\nInvestors' delight i… [+4778 chars]"
    },
    {
        "title": "Up Over 40% This Year, Is Roblox Stock Still a Buy?",
        "description": "For long-term investors, there are still good growth opportunities with Roblox in the long run.",
        "content": "Roblox(RBLX -2.47%) is an online gaming platform that lets users play games in various virtual 3D worlds. Along with having countless games and experiences to enjoy on the platform, users can also cr… [+4234 chars]"
    },
    {
        "title": "Nike Trips Up .SWOOSH Launch While Bitcoin NFTs Soar",
        "description": "Nike’s .SWOOSH NFT drop was filled with missteps, while a Bitcoin NFT collection topped the charts and NFT lending is gaining momentum with Binance and Astaria entering the market.",
        "content": "This week, Bitcoin NFTs are having their moment, placing them just behind Ethereum NFTs in terms of sales. Meanwhile, NFT lending platforms and loan services are also gaining momentum. Blurs Blend is… [+5359 chars]"
    },
    {
        "title": "'Chinese Ethereum’ Conflux Draws Spotlight as Hong Kong Welcomes Retail Traders",
        "description": "CFX tokens initially spiked in price after Hong Kong’s decision on retail investors, which some say could lure capital from Chinese investors.",
        "content": "Tokens of Conflux Network (CFX) an Asia-focused blockchain that some have dubbed the Chinese Ethereum saw a spike in prices earlier amid increased attention from traders after Hong Kong decided to le… [+2535 chars]"
    },
    {
        "title": "Ava Labs Launches 'No-Code' Web3 Launchpad AvaCloud",
        "description": "Ava Labs says that new tool will create greater revenue opportunities and \"sets the stage for mass adoption-ready cloud-based infrastructure in blockchain.\"",
        "content": "Ava Labs, the company behind layer 1 blockchain Avalanche, is launching AvaCloud, a Web3 launchpad that helps businesses build no-code, fully managed blockchain ecosystems.\r\nThe AvaCloud product has … [+2845 chars]"
    },
    {
        "title": "Shiba Inu-Themed Floki Sees Trading Volume Surge Amid China Plans",
        "description": "Floki prices rallied on Sunday amid a bitcoin-led market push and bets on the token's “China narrative.”",
        "content": "Floki (FLOKI) spiked over 10% on Sunday and saw its highest trading volumes in over three weeks as traders bet on the tokens amid a China-focused push for its Valhalla metaverse game.\r\nTrading volume… [+1975 chars]"
    },
    {
        "title": "Former Baidu metaverse head joins Kai-Fu Lee’s Sinovation Ventures amid AI surge: report",
        "description": "Ex-Baidu metaverse chief Ma Jie has reportedly joined Kai-Fu Lee’s Sinovation Ventures as vice president. According to tech media outlet 36Kr, Ma has also established his own AI venture called Lingyi Wanwu. Ma recently resigned from Baidu amid the search engi…",
        "content": "Ex-Baidu metaverse chief Ma Jie has reportedly joined Kai-Fu Lees Sinovation Ventures as vice president. According to tech media outlet 36Kr, Ma has also established his own AI venture called Lingyi … [+616 chars]"
    },
    {
        "title": "What Is Going On With Meta Stock Wednesday",
        "description": "Meta Platforms, Inc (NASDAQ: META) stock is down Wednesday. The company begins its planned third round of layoffs targeting members of Meta’s business groups...",
        "content": "<li>Meta Platforms, Inc (NASDAQ: META) stock is down Wednesday. The company begins its planned third round of layoffs targeting members of Metas business groups.\r\n</li><li>The latest downsizing follo… [+1100 chars]"
    },
    {
        "title": "The Ready Player One Test",
        "description": "Dagan Bernstein explores four guidelines for the implementation of learning that uses immersive technology.\nThe post The Ready Player One Test appeared first on Getting Smart.",
        "content": "By: Dagan Bernstein\r\nInterest in the metaverse has spiked and waned over the past two years. As we cycle through phases of interest it gives us an opportunity to look at the implications of immersive… [+4948 chars]"
    },
    {
        "title": "Apple's MR device will determine Cook's place in company history",
        "description": "Apple is expected to unveil its mixed reality (MR) device at the WWDC in June, the company's first brand-new product since the launch of the Apple Watch back in 2015. Sources believe this may be Tim Cook's last major move for his tenure as Apple CEO, and its …",
        "content": "Apple is expected to unveil its mixed reality (MR) device at the WWDC in June, the company's first brand-new product since the launch of the Apple Watch back in 2015. Sources believe this may be Tim … [+2488 chars]"
    },
    {
        "title": "The Park Playground Expands with its Second UK Venue Opening",
        "description": "Set to open to the public in June, the new Birmingham venue marks The Park Playground’s 13th facility globally and is part of the company’s continued expansion plans following a year of record growth.",
        "content": "Location-based entertainment (LBE) immersive experiences provider, The Park Playground has announced the opening of a second brand-new, state-of-the-art immersive virtual reality entertainment venue … [+3745 chars]"
    },
    {
        "title": "Hong Kong Police Force Unveils Innovative Metaverse Platform ‘CyberDefender’",
        "description": "The Hong Kong police introduced a new Web3 platform called “CyberDefender Metaverse” as part of their technological advancements. To mark this milestone, the police force organized an inaugural event titled “Exploring the Metaverse” within the virtual realm. …",
        "content": "The Hong Kong police introduced a new Web3 platform called “CyberDefender Metaverse” as part of their technological advancements. To mark this milestone, the police force organized an inaugural event… [+3166 chars]"
    },
    {
        "title": "Vertex Labs Acquires Digimental Studio For Us$12 Million",
        "description": "LONDON, UNITED KINGDOM, May 23rd, 2023, Chainwire Vertex Labs (Vertexlabs.uk), the brain behind the Caduceus metaverse protocol, Vertex Network and ... Read more",
        "content": "LONDON, UNITED KINGDOM, May 23rd, 2023, Chainwire\r\nVertex Labs(Vertexlabs.uk),the brain behind the Caduceus metaverse protocol, Vertex Network and 3D metaverse platform, LightCycle, has acquired Lond… [+6411 chars]"
    },
    {
        "title": "Hype And Heartbreak: The Failure Of The Metaverse",
        "description": "The metaverse, a concept that captured the imagination of many as a fully immersive digital universe, has failed to achieve widespread adoption. Facebook's ambitious venture, known as 'Meta' and for which the company changed its core branding, lost billions o…",
        "content": "The metaverse, a concept that captured the imagination of many as a fully immersive digital universe, has failed to achieve widespread adoption.\r\nFacebook’s ambitious venture, known as “Meta” and for… [+6832 chars]"
    },
    {
        "title": "Demystifying the Metaverse: How Digital Twins and Generative AI are Changing the Game",
        "description": "In recent years, the rapid growth of technology has given rise to several buzzworthy themes. Among them, we can mention digital twins, generative AI, and ...\nThe post Demystifying the Metaverse: How Digital Twins and Generative AI are Changing the Game appear…",
        "content": "In recent years, the rapid growth of technology has given rise to several buzzworthy themes. Among them, we can mention digital twins, generative AI, and the metaverse. They are used in many fields, … [+3442 chars]"
    },
    {
        "title": "Shaquille O’Neal finally gets served in FTX lawsuit",
        "description": "He was able to run, but he was not able to hide.NBA legend Shaquille O’Neal, after eluding process servers for months, finally has received a summons and complaint in the class action filed against him and other celebrities (including Tom Brady) over the coll…",
        "content": "He was able to run, but he was not able to hide.\r\nNBA legend Shaquille ONeal, after eluding process servers for months, finally has received a summons and complaint in the class action filed against … [+1361 chars]"
    },
    {
        "title": "The metaverse can lead to better science",
        "description": "One researcher says we should look beyond the hype to see how virtual reality can make scientists more effective. But to realize the benefits, researchers must also plan well and avoid potential pitfalls.",
        "content": "In 2021, Facebook made \"metaverse\" the buzziest word on the web, rebranding itself as Meta and announcing a plan to build \"a set of interconnected digital spaces that lets you do things you can't do … [+4909 chars]"
    },
    {
        "title": "Is Amazon Anywhere Gaming For A New Retail Revenue Source?",
        "description": "Amazon Anywhere, embeds products-for-sale in the augmented reality world of Peridot. Will this latest attempt at retail disruption pay off? These five factors will tell.",
        "content": "Amazon Anywhere is the online giants latest endeavor to further integrate its various sales ... [+] streams: this time by selling goods on the augmented reality game, Peridot (by the makers of Pokémo… [+5670 chars]"
    },
    {
        "title": "Innovating For The Future: A Guide For Product Managers And Engineers",
        "description": "While taking a practical approach to innovation can be challenging, it's important to first define a clear understanding of your goals and to look for models that can guide your way.",
        "content": "Amrit Jassal is the Chief Technology Officer (CTO) and cofounder of Egnyte, a leading cloud-based collaboration and governance platform.\r\ngetty\r\nBack in the 1980s, when I completed my internship with… [+4878 chars]"
    },
    {
        "title": "Shaquille O’Neal finally gets served in FTX lawsuit",
        "description": "He was able to run, but he was not able to hide. NBA legend Shaquille O’Neal, after eluding process servers for months, finally has received a summons and complaint in the class action filed against him and other celebrities (including Tom Brady) over the col…",
        "content": "He was able to run, but he was not able to hide.\r\nNBA legend Shaquille O’Neal, after eluding process servers for months, finally has received a summons and complaint in the class action filed against… [+1468 chars]"
    },
    {
        "title": "This Week in the Metaverse: Bitcoin ups its NFT game, surpassing Solana in weekly volume",
        "description": "The popularity of Ordinals, or Bitcoin NFTs, led to the blockchain compiling the second-highest NFT sales volume over the past week.",
        "content": "Welcome to This Week in the Metaverse, where Fortune rounds up the most interesting news in the world of NFTs, culture, and the metaverse. Email marco.quiroz-gutierrez@fortune.com with tips.Although … [+4243 chars]"
    },
    {
        "title": "BBC Studios And Reality+ Take Doctor Who To The Sandbox Metaverse",
        "description": "BBC Studios has teamed up with Reality+ to launch a collection of immersive experiences in the metaverse based on the BBC’s world-famous brands\nBBC Studios has partnered with Web3 specialist Reality+ to create a metaverse experience in The Sandbox where fans …",
        "content": "BBC Studios has teamed up with Reality+ to launch a collection of immersive experiences in the metaverse based on the BBC’s world-famous brands\r\nBBC Studios has partnered with Web3 specialist Reality… [+2704 chars]"
    },
    {
        "title": "Model F Ultra Compact keyboard review: It somehow improves on IBM’s classic",
        "description": "At a glanceExpert's Rating\r\n\nPros\r\n<ul><li>Excellent typing feel</li><li>Classic layout is instantly familiar</li><li>Durable die-cast metal chassis</li><li>Easy to repair and customize</li></ul>\r\nCons\r\n<ul><li>Heavy key feel isn’t great for fast-paced games<…",
        "content": "Skip to contentType your search and hit enter\r\nWhen you purchase through links in our articles, we may earn a small commission. This doesn't affect our editorial independence\r\n.\r\nAt a glance<ul><li>E… [+8805 chars]"
    },
    {
        "title": "Asus ZenScreen MB249C review: A versatile 24-inch portable monitor",
        "description": "At a glanceExpert's Rating\r\n\nPros\r\n<ul><li>Small, versatile desk stand with unique options</li><li>Sturdy built-in kickstand for portable use</li><li>Offers USB-C for easy single-cable connections</li><li>Good image quality</li></ul>\r\nCons\r\n<ul><li>Lacks addi…",
        "content": "Skip to contentType your search and hit enter\r\nWhen you purchase through links in our articles, we may earn a small commission. This doesn't affect our editorial independence\r\n.\r\nAt a glance<ul><li>S… [+9915 chars]"
    },
    {
        "title": "Facebook owner Meta starts final round of layoffs",
        "description": "NEW YORK (Reuters) -Meta Platforms Inc started carrying out the last batch of a three-part round of layoffs on Wednesday, according to a source familiar with...",
        "content": "By Katie Paul\r\nNEW YORK (Reuters) -Meta Platforms Inc started carrying out the last batch of a three-part round of layoffs on Wednesday, according to a source familiar with the matter, as part of a p… [+1940 chars]"
    },
    {
        "title": "Cathie Wood Defends ARKK’s Decision to Dump Nvidia, Citing Chip-Cycle Risks",
        "description": "(Bloomberg) -- Cathie Wood defended her firm’s decision to bail on Nvidia Corp. before the chipmaker’s shares surged 160%, saying the computer-chip...",
        "content": "(Bloomberg) -- Cathie Wood defended her firms decision to bail on Nvidia Corp. before the chipmakers shares surged 160%, saying the computer-chip industrys boom-bust cycle poses risks.\r\nMost Read fro… [+2362 chars]"
    },
    {
        "title": "Facebook owner Meta starts final round of layoffs",
        "description": "NEW YORK (Reuters) -Meta Platforms Inc started carrying out the last batch of a three-part round of layoffs on Wednesday, according to a source familiar with...",
        "content": "By Katie Paul\r\nNEW YORK (Reuters) -Meta Platforms Inc started carrying out the last batch of a three-part round of layoffs on Wednesday, according to a source familiar with the matter, as part of a p… [+2350 chars]"
    },
    {
        "title": "‘The Hammer’ Set To Make In-Ring Return",
        "description": "Mark Coleman is making a comeback.",
        "content": "Photo by Jeff Bottari/Zuffa LLC\r\n\n \n\n Mark Coleman is making a comeback.\nMMA Mania has confirmed with sources that the former Ultimate Fighting Championship (UFC) Heavyweight champion, Coleman, has s… [+1747 chars]"
    }
]